使用简单查询语句显示：
1）所有部门名称  


2）所有雇员名及全年收入（工资+补助） ，并指定列别名“年收入”


3）存在雇员的所有部门号
      
	

限制查询数据显示：
1）工资超过2850的雇员姓名和工资


2）工资不在1500到2850之间的所有雇员名及工资  



3）代码为7566的雇员姓名及所在部门代码 

 
4）部门10和30中工资超过1500的雇员名和工资 


5）无管理者的雇员名及岗位  
	
	
6)无奖金的雇员的名字及岗位   
	


使用排序数据的方法显示
1）在1981年2月1日~~1981年5月1日之间雇佣的雇员名、岗位及雇佣日期，并以雇佣日期的先后进行排序

	
2）获得补助的所有雇员名，工资及补助金额，并以工资和补助的降序排序


使用分组函数和数据分组字句显示
1）所有雇员的平均工资、总计工资、最高工资、最低工资  

	
2）每种岗位的雇员总数、平均工资  
	

3）雇员总数以及获得补助的雇员数 

 
4）管理者的总人数  

	
使用连接查询方法显示
1）部门20的部门名以及该部门的所有雇员名、雇员工资及岗位



2）获得补助的所有雇员名、补助金额及所在部门名


3）在“DALLAS”工作的所有雇员名、雇员工资及所在部门名


4）雇员SCOTT的管理者名

   


5）查询EMP表和SALGRADE表，显示部门20的雇员名、工资及其工资级别



6）部门10的所有雇员名、部门名以及其他部门名



7）部门10的所有雇员名、部门名以及其他雇员名



使用子查询显示：
1）BLAKE同部门的所有雇员，单不显示BLAKE
	

2）超过平均工资的所有雇员名、工资及部门号

3）超过部门平均工资的所有雇员名、工资及部门号
	
4）高于CLERK岗位所有雇员工资的所有雇员名、工资及补助额


5）工资、补助额与SCOTT完全一致的所有雇员名、工资及补助额


6）显示部门工资总和高于雇员工资总和三分之一的部门名和工资总和



































































